      *****************************************************************
      *                                                               *
      * Hello World                                                   *
      *                                                               *
      *****************************************************************
* this is a comment
identification division.
program-id. HelloWorld.

environment division.
configuration section.

data division.
working-storage section.

procedure division.
      display "Hello World!"

end program HelloWorld.